import React from "react";

const Career = ({ styled }) => {
  return (
    <>
      <div className={styled.career}>
        <h3>🔷 경력사항</h3>
        <table>
          <tbody>
            <tr>
              <th rowSpan="6">경력</th>
              <td>근무기간</td>
              <td>근무처</td>
              <td>직위</td>
              <td>담당업무</td>
              <td>비고</td>
            </tr>
            <tr>
              <td>
                2019.06.01~ <br />
                2020.05.31
              </td>
              <td>맘스터치 가산디지털단지역점</td>
              <td>부점장</td>
              <td>매장관리, 재고관리, 근무스캐줄관리</td>
              <td>19.06.20 교통사고 이후 휴직중 복귀불가로 퇴사</td>
            </tr>
            <tr>
              <td>
                2017.11~ <br />
                2019.04
              </td>
              <td>바로고 송도지사</td>
              <td>실장</td>
              <td>거래처 관리, 근무스캐줄관리</td>
              <td></td>
            </tr>
            <tr>
              <td>
                2016.07~ <br />
                2016.10
              </td>
              <td>과일Farm</td>
              <td>사장</td>
              <td>과일유통</td>
              <td>업무중 교통사고로 정리</td>
            </tr>
            <tr>
              <td>
                2013.10~ <br />
                2015.05
              </td>
              <td>부흥상사 부천 소재 주류회사</td>
              <td>과장</td>
              <td>주류유통, 거래처 관리</td>
              <td></td>
            </tr>
            <tr>
              <td>
                2010.08~ <br />
                2013.05
              </td>
              <td>예티 청주 소재 음식점</td>
              <td>실장</td>
              <td>음식점 주방책임업무 및 아르바이트생 급여 관리</td>
              <td>
                아르바이트생부터 시작
                <br />
                폐업으로 정리
              </td>
            </tr>
          </tbody>
        </table>
      </div>
      <div className={styled.career_mb}>
        <h3>🔷 경력사항</h3>
        <ul>
          <li>
            <h4>맘스터치 가산디지털단지역점</h4>
            <h5>최종 직위 : 부점장</h5>
            <h5>매장관리, 재고관리, 근무스캐줄관리</h5>
            <h5>2019.06.01 ~ 2020.05.31</h5>
          </li>
          <li>
            <h4>바로고 송도지사</h4>
            <h5>최종 직위 : 실장</h5>
            <h5>거래처 관리, 근무스캐줄관리</h5>
            <h5>2017.11 ~ 2019.04</h5>
          </li>
          <li>
            <h4>과일Farm</h4>
            <h5>최종 직위 : 사장</h5>
            <h5>과일유통</h5>
            <h5>2016.07 ~ 2016.10</h5>
          </li>
          <li>
            <h4>부흥상사</h4>
            <h5>최종 직위 : 과장</h5>
            <h5>주류유통, 거래처 관리</h5>
            <h5>2013.10 ~ 2015.05</h5>
          </li>
          <li>
            <h4>예티</h4>
            <h5>최종 직위 : 실장</h5>
            <h5>음식점 주방책임업무 및 아르바이트생 급여 관리</h5>
            <h5>2010.08 ~ 2013.05</h5>
          </li>
        </ul>
      </div>
    </>
  );
};

export default Career;
