import React from "react";
import styled from "../../css/SelfIntro.module.css";

const SelfIntro = () => {
  return (
    <>
      <div className={styled.selfintro}>
        <h3>🔶 자기소개서</h3>
        <ul>
          <li>
            <h4>성장 과정</h4>
            <p>
              2019년 6월 19일. 당시 부점장으로 근무하던 장소에서 힘든 일과를
              마치고 잠들기 이전까지는 일반적인 사람들과 크게 다를 것 이 없던
              평범한 사람이었습니다. 기억은 안 나지만 다음날 출근하던 길에
              교통사고가 나면서 제 삶은 이전과는 많이 다르게 바뀌었습니다.
            </p>
            <p>
              그 날의 사건이후로 오른팔을 편하게 사용할 수 없게 되었고 그로인해
              이전에 목표였던 요식업 경영자로는 일을 할 수 없게 되었습니다. 긴
              회복과정을 겪고 목표가 사라져 아무것도 하고싶지 않았던 시기가
              있었지만, 큰 교통사고 이후 살아있는 것만으로도 고맙다는 말씀을
              하시는 부모님을 위해서라도 ‘내가 잘 살아야하지 않겠는가’ 라는
              생각을 하게 되었습니다. 과거부터 관심이 많았던 IT 관련 업종을
              찾아보던 중 늘 coding에 관심이 많던 저에게 ‘프론트 엔드 개발’
              이라는 직업이 와 닿았습니다.
            </p>
            <p>
              하지만 그 직업을 선택하기 위해서는 필요한 지식이 부족 하다 느꼈고,
              그래서 현재까지 ‘프론트 엔드 개발’의 기초를 쌓으면서 제 2의 인생을
              위해 준비하고 있습니다. 현재 오른팔의 상태는 많이 회복하여 평소
              4~6시간, 길게는 12시간 코딩을 해도 크게 무리가 가지 않는
              상태입니다.
            </p>
          </li>
          <li>
            <h4>성격</h4>
            <p>
              배려심이 좋다고 주변에서 많이 말했습니다. 배려심이 좋다는 것은 꼭
              좋다고 할 수 없지만 주변 사람들에게 좋은 인상을 줄 수 있고 단체
              생활에 있어서 쉽게 다가갈 수 있다고 생각합니다. 하지만 제 배려심을
              역 이용하여 금전적인 피해를 받은 사례도 있습니다. 그 경험을 통해
              배려있는 행동을 할 때 기준점도 생기게 되었습니다.
            </p>
            <p>
              그리고 어떠한 일을 할 때 같이 하는 타인의 의견을 많이 존중합니다.
              최종 결론을 낼 때에는 의견들을 종합하여 논리적이면서 이성적인
              근거를 갖는 결과를 찾아내려는 성격을 갖고 있습니다. 그런데
              팀원들의 의견을 없을 때에는 내 의견을 말하면서 근거를 말하고 이에
              대해 생각을 물어보고 결정합니다. 내 스스로의 주장이 강한 편이나 그
              주장이 논리적이고 이성적인지 그것에 대해 이야기 해보는 것을
              좋아하고 그 결과를 받아드리고 만족해 합니다.
            </p>
          </li>
          <li>
            <h4>사회 경험</h4>
            <p>
              대학교 졸업 이후 직업에 큰 상관없이 어디서든 일을 해보았습니다.
              대학교 입학 때부터 음식점을 운영하고 싶은 욕심이 있었고, 그것을
              위해서는 요리 실력도 중요하지만 많은 경험이 더 중요하다
              생각했습니다. 그래서 한가지의 일만 고집하지 않고 다양한 경험을
              하고 싶었고, 그러면서 재산도 모아야 했습니다. 그러면서 일반
              사무직부터 현장으로 나가서 힘도 많이 쓰는 힘든 일 등 다양한 업무를
              경험해 볼 수 있게 되었습니다.
            </p>
            <p>
              여러 일을 하면서도 컴퓨터는 늘 가까이 두고 지냈습니다. 직접
              컴퓨터를 조립 할 수 있으며, IT기술에 관심이 많았고 2017년에는
              정보보안에 흥미가 생겨 관련 학원에서 수강을 들은 경험도 있습니다.
              이때 coding을 처음 해 보았는데 재미있게 느꼈고 이 경험이
              교통사고로 힘들었던 나를 새로운 길로 안내해주는 안내 역할을
              해주었습니다.
            </p>
          </li>
          <li>
            <h4>입사 후 포부</h4>
            <p>
              다양한 업무를 경험해본 점과 IT관련하여 흥미가 많고 쉽게 배웠던 점
              그리고 앞으로도 더욱 배울 의지가 강하다는 점이 앞으로 새로 시작될
              업무에 도움이 될 것이라고 생각합니다.
            </p>
            <p>
              일이 재미있다고 느낄 때 효율이 가장 좋은 것 같습니다. 비록
              신입이라 부르기엔 많은 나이이고 경험해보지 않은 업무지만 모르는
              것을 알아갈 때의 즐거움, 불가능하던 것이 가능하게 될 때의
              즐거움으로 ‘웹개발자’ 로서의 업무를 시작하겠습니다.
            </p>
            <p>
              ‘천재는 노력하는 자를, 노력하는 자는 즐기는 자를 이기지 못한다.’는
              말이 있습니다. 그런만큼 그 누구보다도 성실하게 그리고 즐겁게
              일하며 좋은 성과를 통해 고객에게 인정받고 회사로부터 인정받는
              직원이 되기 위해 노력하겠습니다.
            </p>
            <p>읽어주신 담당자분께 감사드립니다.</p>
          </li>
        </ul>
      </div>
    </>
  );
};
export default SelfIntro;
